var sol = new Array;
var elu = new Array;
var nspecial = ["1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "”", "“", " ", "[", "]", "=", "+", ";", ",", "?", "(", ")", "-", "!", ".", "’", "‘", ":", "%", "*"];
var nonvow = "ா,ி,ீ,ு,ூ,ெ,ே,ை,ொ,ோ,ௌ,்".split(",");
var uyir = "அ,ஆ,இ,ஈ,உ,ஊ,எ,ஏ,ஐ,ஒ,ஓ,ஔ".split(",");
var mey = "க,ங,ச,ஞ,ட,த,ந,ப,ம,ய,ர,ல,வ,ற,ள,ழ,ண,ன".split(",");
var ssol = "கடைசி|,சின்ன|,வேண்டா|p5,ஏற்று|,எல்லா|p7,அந்த|,எந்த|,இந்த|,அப்படி|,அங்கு|,எங்கு|,இங்கு|,ஆங்கு|,ஈங்கு|,யாங்கு|,இப்படி|,எப்படி|,ஈண்டு|,ஆண்டு|,யாண்டு|,எத்துணை|,அத்துணை|,இத்துணை|,தனி|,என|,முன்னர்|,பின்னர்,அரை|,பாதி|,இன்றி|,அன்றி|,மற்றை|,சிறப்பு|,அ|p1,இ|p1,எ|p1,நடு|p2,புது|p2,பொது|p2,பசு|p2,திரு|p2,முழு|p2,விழு|p2,என்னை|u2,நம்மை|u2,எம்மை|u2,உன்னை|u2,நின்னை|u2,உம்மை|u2,உங்களை|u2,தன்னை|u2,தம்மை|u2,தங்களை|u2,அவளை|u2,அவனை|u2,இவரை|u2,அவரை|u2,அதனை|u2,இதனை|u2,எதனை|u2,அவற்றை|u2,இவற்றை|u2,எவற்றை|u2,என்பதை|u2,அதை|u2,இதை|u2,எதை|u2,தமிழை|u2,வில்லை|u2,பொருட்டு|u4,எனக்கு|u4,எனக்காக|u4,நமக்கு|u4,எமக்கு|u4,நமக்காக|u4,எமக்காக|u4,உனக்கு|u4,நினக்கு|u4,உனக்காக|u4,நினைக்காக|u4,உமக்கு|u4,உங்களுக்கு|u4,உமக்காக|u4,உங்களுக்காக|u4,தனக்கு|u4,தனக்காக|u4,தமக்கு|u4,தமக்காக|u4,தங்களுக்கு|u4,அவற்கு|u4,அவட்கு|u4,அவர்க்கு|u4,தங்களுக்காக|u4,அதற்கு|u4,இதற்கு|u4,எதற்கு|u4,அவற்றிற்கு|u4,இவற்றிற்கு|u4,எவற்றிற்கு|u4,நிறைய|,குறைய|,முக்கிய|p7,அடுத்த|,சரிவர|,அதிக|p7,வாக்கிய|p7,ஐக்கிய|p7,இலக்கிய|p7,ஆரோக்கிய|p7,பாக்கிய|p7,அற்று|p8".split(",");
var cssol = "தெரு,அணு,வரி".split(",");
var sviku = "மிக|மிக,தவிர|தவிர,பற்றி|பற்றி,மாற|மாற,கூட|கூட,போல|போல,தவ|தவ,வகை|வகை,ிலக்கிய|இலக்கிய,லன்றி|அன்றி,தன்றி|அன்றி".split(",");
var vkutrlilu = "க்கு,ச்சு,ட்டு,த்து,ப்பு,ற்று".split(",");
var valli = "க,ச,ட,த,ப,ற".split(",");
var melli = "ங,ஞ,ந,ண,ம,ன".split(",");
var idai = "ய,ர,ல,வ,ழ,ள".split(",");
var nvarusol = "சரியா,சரியா?,பாணம்,குரு,சார்".split(",");
var cnvarusol = ["கூட"];
var nvaru = "தெய்வ,தேசிய,பாணி,சுவாமி,சக்தி,தினம்".split(",");
var nviku = "ே|d0-ஏ,ோ|d0-ஓ,க்|d5,ங்|d5,ச்|d5,ஞ்|d5,ட்|d5,ண்|d5,த்|d5,ந்|d5,ம்|d5,ப்|d5,ற்|d5,ல்|d5,வ்|d5,ள்|d5,ன்|d5,ஸ்|d5,ஷ்|d5,ஜ்|d5,ஹ்|d5,அ|d7,ஆ|d7,இ|d7,ஈ|d7,உ|d7,ஊ|d7,எ|d7,ஏ|d7,ஐ|d7,ஒ|d7,ஓ|d7,ஔ|d7,ஃ|d7,னர்|d8-அர்,தார்|d8-ஆர்,கின்றனர்|d8-அர்,கின்றார்|d8-ஆர்,றோர்|d8-ஓர்,கிறார்|d8-ஆர்,யார்|d8-ஆர்,வர்|d8-அர்,வார்|d8-ஆர்,வோர்|d8-ஓர்,கின்றது|d9-அது,தது|d9-அது,கிறது|d9-அது,பது|d9-அது,வது|d9-அது,ன்றன|da-அன,ிர்|d4,கொண்டு|u3,கீழே|u7,மேலே|u7,கீழ்|u7,ோட|u6-ஓட,ுடைய|u6-உடைய,ொரு|ஒரு,ிரு|இரு,போது|போது,டற்ற|d3-அற்ற,மற்ற|d3-அற்ற,வற்ற|d3-அற்ற,ில்லாத|d3-இல்லாத,மானவை|ஆனவை,ுமுறை|முறை,்முறை|முறை,ைமுறை|முறை,தமுறை|முறை,லமுறை|முறை,ென்ன|d6-என்ன,வந்து|வந்து,இல்லை|இல்லை,ில்லை|இல்லை,ிரண்டு|d2-இரண்டு,நூறு|d2-நூறு,டது|அது,யவை|அவை,றவை|அவை,ுன்னு|என்று,ென்று|p4-என்று,ேன்னு|என்று,போன்ற|போன்ற,தகாத|d3-தகாத,பிறகு|பிறகு,வேளை|வேளை,போன்று|போன்று,வெகு|வெகு,சிறிய|d1,பெரிய|d1,புதிய|d1,ன்படி|p6,ல்படி|p6,ம்படி|p6,துவரை|வரை,்வரை|வரை,வேறு|வேறு,மல்ல|அல்ல,தல்ல|அல்ல,றிரவு|இரவு".split(",");
var nsol = "நன்கு|p4,கடந்து|p4,நடந்து|p4,தொடர்ந்து|p4,வரை|,நேற்று|,வெகு|,இனி|d0,நல்ல|d1,கரிய|d1,அரிய|d1,பழைய|d1,இனிய|d1,இளைய|,மூத்த|,அங்க|,அங்கே|,இங்க|,இங்கே|,ஏதோ|,நீங்க|,இவரு|,நீ|,உங்களது|u6,இவரது|u6,அவரது|u6,எனது|u6,உனது|u6,நினது|u6,தமது|u6,தனது|u6,அது|p3,எது|p3,இது|p3,உது|p3,நமது|u6,எமது|u6,உமது|u6,ஏது|,ஏன்|,யாது|,அவை|,எவை|,இவை|,யாவை|,அத்தனை|,எத்தனை|,இத்தனை|,அவ்வளவு|,எவ்வளவு|,இவ்வளவு|,இத்தகைய|,அத்தகைய|,எத்தகைய|,எது|,என்பது|,பண்டு|d0,முந்து|d0,அன்று|d0,நாளை|d0,இன்று|d0,என்று|d0,அன்றைய|d0,நேற்றைய|d0,நாளைய|d0,இன்றைய|d0,என்றைய|d0,முந்தைய|d0,பிந்தைய|d0,அவ்வாறு|,இவ்வாறு|,எவ்வாறு|,ஒன்று|d2,இரண்டு|d2,மூன்று|d2,நான்கு|d2,ஐந்து|d2,ஆறு|d2,ஏழு|d2,ஒன்பது|d2,நூறு|d2,ஒரு|d2,ஓர்|d2,இரு|d2,அறு|d2,எழு|d2,பல|d2,சில|d2,என்ன|,சிறு|,முது|,மறு|,என்ற|,புகழ்|,கண்டு|,செய்து|,சரியான|,என்றோ|,அன்ன|,ஒரே|d2,இல்லாத|d3,செல்லாத|d3,காணாத|d3,ஓடாத|d3,அம்மா|d4,அப்பா|d4,தம்பி|d4,தங்கை|d4,அக்கா|d4,அண்ணா|d4,தாத்தா|d4,பாட்டி|d4,தோழி|d4,நண்பர்|d4,மனைவி|d4,தந்தை|d4,மாமா|d4,என்னோடு|,தன்னொடு|,அல்லது|,அல்லாது|,அல்ல|,இதோ|,அதோ|,மேதகு|,மாண்புமிகு|,டாக்டர்|,பலர்|,சிலர்|,சும்மா|,முதலிய|,சரி|,பிற|,அக்கறை|,நன்றி|,முடியாது|,ஆகிய|,இரவு|,தவறு|,உங்க|,சிறந்த|d1".split(",");
var d0 = "இடைச்சொல்";
var d1 = "குறிப்புப் பெயரெச்சம்";
var d2 = "எண்ணுப்பெயர்";
var d3 = "எதிர்மறைப் பெயரெச்சம்";
var d4 = "உயர்திணைச் சொல்";
var d5 = "ஒற்றெழுத்து";
var d6 = "உணர்ச்சி வார்த்தை";
var d7 = "உயிரெழுத்து";
var d8 = "பலர்பாற் படர்க்கை விகுதி";
var d9 = "ஒன்றன்பால் விகுதி";
var da = "பலவின்பால் விகுதி";
var u2 = "இரண்டாம் வேற்றுமை உருபு";
var u3 = "மூன்றாம் வேற்றுமை உருபு";
var u4 = "நான்காம் வேற்றுமை உருபு";
var u5 = "ஐந்தாம் வேற்றுமை உருபு";
var u6 = "ஆறாம் வேற்றுமை உருபு";
var u7 = "ஏழாம் வேற்றுமை உருபு";
var p1 = "சுட்டெழுத்து";
var p2 = "முற்றியலுகரச்சொல்";
var p3 = "சுட்டுப்பெயர்";
var p4 = "மென்தொடர்க் குற்றியலுகர வினைச்சொல்";
var p5 = "ஈறுகெட்ட எதிர்மறைப் பெயரெச்சம்";
var p6 = "பெயரெச்சத்தோடு படி";
var p7 = "மகரம்  கெட்ட சொல்";
var p8 = "வன்தொடர்க் குற்றியலுகர வினையெச்சச்சொல்";
for (i = 0; i < nsol.length; i++) {
  nsol[i] = nsol[i].replace(/d0/gi, d0);
  nsol[i] = nsol[i].replace(/d1/gi, d1);
  nsol[i] = nsol[i].replace(/d2/gi, d2);
  nsol[i] = nsol[i].replace(/d3/gi, d3);
  nsol[i] = nsol[i].replace(/d4/gi, d4);
  nsol[i] = nsol[i].replace(/p3/gi, p3);
  nsol[i] = nsol[i].replace(/p4/gi, p4);
  nsol[i] = nsol[i].replace(/u6/gi, u6 + " உள்ள");
}
;
for (i = 0; i < nviku.length; i++) {
  nviku[i] = nviku[i].replace(/d0/gi, d0);
  nviku[i] = nviku[i].replace(/d1/gi, d1);
  nviku[i] = nviku[i].replace(/d2/gi, d2);
  nviku[i] = nviku[i].replace(/d3/gi, d3);
  nviku[i] = nviku[i].replace(/d4/gi, d4);
  nviku[i] = nviku[i].replace(/d5/gi, d5 + "-" + nviku[i].split("|")[0]);
  nviku[i] = nviku[i].replace(/d6/gi, d6);
  nviku[i] = nviku[i].replace(/d7/gi, d7 + "-" + nviku[i].split("|")[0]);
  nviku[i] = nviku[i].replace(/d8/gi, d8);
  nviku[i] = nviku[i].replace(/d9/gi, d9);
  nviku[i] = nviku[i].replace(/da/gi, da);
  nviku[i] = nviku[i].replace(/u3/gi, u3 + "-" + nviku[i].split("|")[0]);
  nviku[i] = nviku[i].replace(/u4/gi, u4);
  nviku[i] = nviku[i].replace(/u6/gi, u6);
  nviku[i] = nviku[i].replace(/p6/gi, p6);
  nviku[i] = nviku[i].replace(/p4/gi, p4);
  nviku[i] = nviku[i].replace(/u7/gi, u7 + "-" + nviku[i].split("|")[0]);
}
;
for (i = 0; i < ssol.length; i++) {
  ssol[i] = ssol[i].replace(/p1/gi, p1);
  ssol[i] = ssol[i].replace(/p2/gi, p2);
  ssol[i] = ssol[i].replace(/p5/gi, p5);
  ssol[i] = ssol[i].replace(/p7/gi, p7);
  ssol[i] = ssol[i].replace(/p8/gi, p8);
  ssol[i] = ssol[i].replace(/u2/gi, u2 + " உள்ள");
  ssol[i] = ssol[i].replace(/u4/gi, u4 + " உள்ள");
}
;
var vurubu2t = ["பற்றி", "போன்ற", "போல", "போல்", "பற்றிய"];
var vurubu2 = "ததை|1,சியை|1,ந்தியாவை|1,யினை|1,ற்றினை|1,த்தினை|1,ருப்பை|1,றுப்பை|1,ுப்பதை|1,சத்தை|1,பத்தை|1,தத்தை|1,ணத்தை|1,கத்தை|1,டத்தை|1,லத்தை|1,வத்தை|1,ளத்தை|1,வனை|1,ட்டதை|1,்களை|1,ப்புகளை|1,க்குகளை|1,ச்சுகளை|1,ட்டுகளை|1,த்துகளை|1,ற்றுகளை|1,்வதை|1,ுவதை|1,ன்னதை|1,யத்தை|1,வளை|0,ர்களை|1,னத்தை|1,ற்றை|1,ங்களை|1,த்துகளை|1,ைகளை|1,களை|1,ையை|1,வியை|1,ணியை|1,ழியை|1,ாரத்தை|1,ாட்டை|1,ண்ணை|1,ூணை|1,ை|0".split(",");
var vurubu3 = ["ொடு", "ோடு"];
var vurubu4 = "கட்கு|1,களுக்கு|1,னுக்கு|1,ைக்கு|1,ளுக்கு|1,தற்கு|1,த்திற்கு|1,க்காக|1,ற்றுக்கு|1,ிற்கு|1,குக்கு|1,லுக்கு|1,வுக்கு|1,விக்கு|1,துக்கு|1,வர்க்கு|1,வருக்கு|1,ிழுக்கு|1,க்கு|0,ாக|1".split(",");
var vurubu5 = "லிருந்து,னின்று,இருந்து,யிருந்து,மிருந்து".split(",");
var vurubu6 = "அது|,ஆது|,ரது|,யது|,னது|,ளது|,களது|".split(",");
var vurubu7 = "ில்,டை".split(",");
var ppeyar = "ட்சி,ரசு,ம்பு,ாளி,ஞர்,மிழ்,ச்சி,ற்சி,ணீர்,வறு,கார்,ங்,ஞ்,ட்,ண்,ந்,வ்,ழ்,ற்,ஸ்,ஷ்,ஜ்,ஹ்,அ,ஆ,இ,ஈ,உ,ஊ,எ,ஏ,ஐ,ஒ,ஓ,ஔ,ஃ,ம்,மை,வு,வி,ப்பு,ழக்கு,லக்கு,ளக்கு,பண்ணை,திண்ணை,எண்ணை,நடத்தை".split(",");
var peyar = "கை,ஞை,சை,டை,ணை,நை,பை,றை,னை,கத்தை,சத்தை,டத்தை,னத்தை,ணத்தை,தத்தை,நத்தை,பத்தை,மத்தை,யத்தை,ரத்தை,லத்தை,வத்தை,ழத்தை,ளத்தை,றத்தை,த்திலேயே,ில்,கத்தால்,யாக,பின்,போது,த்திற்கு,த்துக்கள்,த்துகள்,களுக்கு,களுக்கான,களுடன்,களே,களில்,ங்கள்,்களை".split(",");
var apeyar = "ும்,வ்வி,ுங்கள்,ததில்,ோம்,வையில்,வற்றில்,வற்றை,வனை,தாளி,ர்களுக்கு".split(",");
var venai = "றது,படும்,பட்ட,தலால்,ண்டால்,னால்,ந்தான்,ன்றான்,ண்டான்,ிறான்,படுத்த,வேண்டும்,றினார்,ுத்தால்,ுள்ளேன்,ள்ளார்,ட்டார்கள்,விட்டார்,பட்டார்,கின்றார்,பட்டது,விட்டது,ுவான்,றான்,னான்,ுங்கள்,கொண்டு,கிடையாது,தெரியாது,தலாக,தாக,மாக,ய்தேன்,த்தேன்,க்கேன்,ச்சேன்,ண்டேன்,ற்றேன்,ட்டேன்,ப்பேன்,ந்தேன்,கியது,தியது,டியது,போனது,றதும்,கிறோம்,கிறாய்,கியதும்,தியதும்,டியதும்,ட்டாலும்,்தாலும்,்றலும்,ிருந்த,கிறேன்,ண்டது,ன்னது,ந்தது,ப்பது,ய்வது,ள்வது,த்தது,ண்டதும்,ன்னதும்,ததும்,ப்பதும்,ய்வதும்,ள்வதும்,போனதும்,ிருக்கும்,ிருக்க,ிருந்தால்,ிருக்கு,கொள்ள,கொள்ளும்,்வோம்,கொண்டார்,்பவர்கள்,்பவர்,ுபவர்க்கு,ிருக்கிறார்கள்,ிருக்கிறார்,ள்ளோம்,ய்ய,தாக,ானதே,ாகும்,ய்து,யலாம்,க்கலாம்,ள்ளலாம்,செல்லும்,வதற்கும்,வதற்கு,ாமல்,ணலாம்,கின்றன,முடியும்,ுமாறு,கூடாது,கொண்டே,கொண்ட,போனார்,ந்தார்,டன,ய்தன,த்தன,ய்தார்,ருந்தோம்".split(",");
var vppin = "தான்,கள்".split(",");
var avenai = "கூட்டுமாறு,பெருக்குமாறு,ஈர்க்குமாறு,விளக்குமாறு".split(",");
var vecham = "போக|1,பட|1,மடைய|1,யடைய|1,வடைய|1,ிருக்க|1,ய்ய|1,கொள்ள|1,வாங்கி|1,டங்கி|1,மாய்|1,அழைத்து|1,ித்து|1,ிக்க|1,ுத்த|2,ைக்க|1,ுக்க|1,ியங்க|1,வதாய்|1,என|1,ஆக|1,ராகி|1,ாய்|2,ென|1,படுத்தி|1,ோற்றி|1,ாற்றி|1,ப்பி|1,ர்த்தி|1,ின்றி|1,ும்ப|1,ப்பட்டு|1,ப்பட|1,போய்|1,விட|2,ட|0,றி|2,ல|0,ி|0,ோய்|0,ர|0,ன்ற|0".split(",");
var pecham = "னாய்|,னைய|,த்தக்க|,தக்க|,பெற்ற|,ுவான|,ுள்ள|,சென்ற|,டந்த|,வந்த|,கொண்ட|,ாகிய|,்பான|,தற்கான|,க்கான|,ற்கான|,ழகான|,டான|,க்கிய|2,ங்கிய|,ஞ்சிய|,ட்டிய|,த்திய|,ம்பிய|,வ்விய|,லாவிய|,ள்ளிய|,ல்லிய|,ண்ணிய|,த்திய|,ற்றிய|,ுதிய|,ுவிய|,யான|,கமான|,சமான|,டமான|,தமான|,பமான|,றமான|,யமான|,ரமான|,லமான|,்வமான|,ழமான|,ளமான|,னமான|,களான|,கூடிய|,வறான|,லான|,ரான|,க்குரிய|,றந்த|,ுத்த|,றித்த|,ைத்த|,ைந்த|,ித்த|,ேர்ந்த|,ார்ந்த|,லகிய|,ளகிய|,ழகிய|,்டிய|,ிருந்த|,ுந்த|,ேசிய|,ிய|0,த்த|0,கிற|,ந்த|0,கின்ற|,போன|,ப்பட்ட|,ற்பட்ட|,ைபட்ட|,விட்ட|,மிட்ட|,லிட்ட|,ான|0".split(",");
var oruword = "அ,ஆ,ஈ,ஊ,ஏ,ஓ,கா,கு,கூ,கை,கோ,சா,சீ,சே,சோ,டீ,தா,தீ,து,தூ,தெ,தை,நா,நீ,நூ,நை,நொ,நோ,பா,பீ,பு,பூ,பை,போ,மா,மீ,மு,மூ,மே,மை,யா,வா,வீ,வே,வை,வௌ".split(",");
var epecham = "ையாத|,ியாத|,க்காத|,ங்காத|,ிகாத|,ச்சாத|,ஞ்சாத|,ட்டாத|,த்தாத|,ந்தாத|,ம்பாத|,ய்யாத|,ல்லாத|,வ்வாத|,ன்றாத|,ள்ளாத|,ணாத|,ன்னாத|,றாத|,ாராத|,வராத|,ாத|0".split(",");
var kutrilu = "ிந்து|,ண்டு|0,ந்து|0,ன்று|0,ய்து|0".split(",");
var mutrilu = "கு,சு,டு,து,பு,று,ணு,மு,னு,யு,ரு,லு,வு,ழு".split(",");
var vmuttru = "்க|0,ய|0,ி|0,ியர்|".split(",");
var nedil = "ா,ஆ,ஈ,ஊ,ஏ,ஓ,ீ,ூ,ே,ோ".split(",");
var uyirmey = "ஓர்|ஒரு,ஈர்|இரு,அஃது|அது,இஃது|இது,அஃதாவது|அதாவது".split(",");
var mviku = "ம்ப,றாட,லக,ணிக,ழக,தேக,முக,மத,டக்க,கில,மூக,ரக,ரவ,கண,ாய,ஞான,்தர,ாதார,சார,கர,தய,தள,பாண,ரண,வண,மண,பண,யண,தக,னத,ரத,கால,துவ,ிமான,ணைய,விட,நுண்ணிய,பெண்ணிய,புண்ணிய".split(",");
var doudt = "நாட்டிய,விட்ட".split(",");
var speler = ["க்கபட்ட|க்கப்பட்ட"];
var vilasol = ["தத்தை"];
var temp = "";
function dome() {
  temp = "";
  var _0x93b6x48 = document.vizuthukal.tbox.value;
  _0x93b6x48 = _0x93b6x48.replace(/\n/gi, " <br/> ");
  _0x93b6x48 = _0x93b6x48.replace(/​/gi, " ");
  _0x93b6x48 = " " + _0x93b6x48;
  for (_0x93b6x4d = 0; _0x93b6x4d < 10; _0x93b6x4d++) {
    _0x93b6x48 = _0x93b6x48.replace(/  /gi, " ");
  }
  ;
  _0x93b6x48 = _0x93b6x48.replace(" ", "");
  var _0x93b6x49 = (_0x93b6x48 + " $$$$$").replace(/  /gi, " ");
  var _0x93b6x4a = _0x93b6x48.replace(/\"/gi, "&#34;").split(" ");
  _0x93b6x49 = _0x93b6x49.replace(/\'/gi, "");
  var _0x93b6x4b = _0x93b6x49.split(" ");
  var _0x93b6x4c = new Array(_0x93b6x4b.length);
  for (var _0x93b6x4d = 0; _0x93b6x4d < _0x93b6x4b.length; _0x93b6x4d++) {
    _0x93b6x4c[_0x93b6x4d] = new Array(7);
    _0x93b6x4c[_0x93b6x4d][0] = "0";
    _0x93b6x4c[_0x93b6x4d][1] = "";
    _0x93b6x4c[_0x93b6x4d][2] = "";
    _0x93b6x4c[_0x93b6x4d][3] = "";
    _0x93b6x4c[_0x93b6x4d][4] = "0";
    _0x93b6x4c[_0x93b6x4d][5] = "";
    _0x93b6x4c[_0x93b6x4d][6] = "0";
  }
  ;
  _0x93b6x4c[_0x93b6x4b.length - 1][0] = "";
  for (_0x93b6x4d = 1; _0x93b6x4d < _0x93b6x4b.length; _0x93b6x4d++) {
    if (_0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 1] == String.fromCharCode(3021)) {
      if (_0x93b6x4b[_0x93b6x4d][0] == String.fromCharCode(2965) && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 2] == String.fromCharCode(2965) || _0x93b6x4b[_0x93b6x4d][0] == String.fromCharCode(2970) && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 2] == String.fromCharCode(2970) || _0x93b6x4b[_0x93b6x4d][0] == String.fromCharCode(2980) && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 2] == String.fromCharCode(2980) || _0x93b6x4b[_0x93b6x4d][0] == String.fromCharCode(2986) && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 2] == String.fromCharCode(2986)) {
        _0x93b6x4b[_0x93b6x4d - 1] = _0x93b6x4b[_0x93b6x4d - 1].slice(0, _0x93b6x4b[_0x93b6x4d - 1].length - 2);
        _0x93b6x4c[_0x93b6x4d - 1][5] = "1";
      }
      ;
    }
    ;
  }
  ;
  for (_0x93b6x4d = 1; _0x93b6x4d < _0x93b6x4b.length; _0x93b6x4d++) {
    if (_0x93b6x4b[_0x93b6x4d - 1] == "<br/>") {
      _0x93b6x4c[_0x93b6x4d - 1][0] = "";
    }
    ;
    for (j = 0; j < nspecial.length; j++) {
      summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(nspecial[j]);
      if (summa[summa.length - 1] == "a") {
        _0x93b6x4c[_0x93b6x4d - 1][0] = "";
        _0x93b6x4c[_0x93b6x4d - 1][2] = "<li>குறியீடு " + nspecial[j] + " கொண்ட சொல்லுக்கு மிகாது</li>";
        var _0x93b6x4e = "";
        for (k = 0; k < summa.length - 1; k++) {
          _0x93b6x4e = _0x93b6x4e + summa[k];
        }
        ;
        _0x93b6x4b[_0x93b6x4d - 1] = _0x93b6x4e;
        break;
      }
      ;
    }
    ;
    if (_0x93b6x4b[_0x93b6x4d - 1].charCodeAt(_0x93b6x4b[_0x93b6x4d - 1].length - 1) < 126 && _0x93b6x4b[_0x93b6x4d - 1].charCodeAt(_0x93b6x4b[_0x93b6x4d - 1].length - 1) > 46) {
      _0x93b6x4c[_0x93b6x4d - 1][0] = "";
      _0x93b6x4c[_0x93b6x4d - 1][2] = "<li>" + _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 1] + " என்பதற்குப்  பின் வழி மிகாது</li>";
    }
    ;
    if (_0x93b6x4b[_0x93b6x4d][0] != String.fromCharCode(2965) && _0x93b6x4b[_0x93b6x4d][0] != String.fromCharCode(2970) && _0x93b6x4b[_0x93b6x4d][0] != String.fromCharCode(2980) && _0x93b6x4b[_0x93b6x4d][0] != String.fromCharCode(2986)) {
      _0x93b6x4c[_0x93b6x4d - 1][0] = "";
      _0x93b6x4c[_0x93b6x4d - 1][2] = "<li>அடுத்த வார்த்தை \\'க\\', \\'ச\\', \\'த\\', \\'ப\\' எழுத்துகளில் தொடங்கவில்லை</li>";
    }
    ;
    summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split('"');
    if (summa[summa.length - 1] == "a") {
      _0x93b6x4c[_0x93b6x4d - 1][0] = "";
      _0x93b6x4c[_0x93b6x4d - 1][2] = "<li>குறியீடு &#34; கொண்ட சொல்லுக்கு மிகாது</li>";
      _0x93b6x4b[_0x93b6x4d - 1] = _0x93b6x4b[_0x93b6x4d - 1].replace('"', "");
    }
    ;
    if (_0x93b6x4b[_0x93b6x4d - 1][0] == '"') {
      _0x93b6x4b[_0x93b6x4d - 1] = _0x93b6x4b[_0x93b6x4d - 1].replace('"', "");
    }
    ;
    for (j = 0; j < nspecial.length; j++) {
      if (_0x93b6x4b[_0x93b6x4d - 1][0] == nspecial[j]) {
        _0x93b6x4b[_0x93b6x4d - 1] = _0x93b6x4b[_0x93b6x4d - 1].replace(nspecial[j], "");
      }
      ;
    }
    ;
    if (_0x93b6x4b[_0x93b6x4d][1] == "்") {
      _0x93b6x4c[_0x93b6x4d - 1][0] = "";
      _0x93b6x4c[_0x93b6x4d - 1][2] = "<li>அடுத்த வார்த்தை ஒற்றெழுத்தில்  வருவதால் வலிமிகாது </li>";
    }
    ;
    if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
      for (j = 0; j < nsol.length; j++) {
        if (_0x93b6x4b[_0x93b6x4d - 1] == nsol[j].split("|")[0]) {
          _0x93b6x4c[_0x93b6x4d - 1][0] = "";
          _0x93b6x4c[_0x93b6x4d - 1][2] = "<li>" + nsol[j].split("|")[1] + "- \\'" + nsol[j].split("|")[0] + "\\' என்னும் வார்த்தைக்குப் பின்மிகாது</li>";
          break;
        }
        ;
      }
      ;
    }
    ;
    if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
      for (j = 0; j < ssol.length; j++) {
        if (_0x93b6x4b[_0x93b6x4d - 1] == ssol[j].split("|")[0]) {
          _0x93b6x4c[_0x93b6x4d - 1][0] = "1";
          _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>" + ssol[j].split("|")[1] + " -\\'" + ssol[j].split("|")[0] + "\\' என்னும் வார்த்தைக்குப் பின்*</li>";
          _0x93b6x4c[_0x93b6x4d - 1][4] = "4";
          break;
        }
        ;
      }
      ;
    }
    ;
    if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
      for (j = 0; j < nviku.length; j++) {
        summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(nviku[j].split("|")[0]);
        if (summa[summa.length - 1] == "a") {
          _0x93b6x4c[_0x93b6x4d - 1][0] = "";
          _0x93b6x4c[_0x93b6x4d - 1][2] = "<li>" + nviku[j].split("|")[1] + " என்று முடியும் சொல்லுக்கு மிகாது</li>";
          break;
        }
        ;
      }
      ;
    }
    ;
    if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
      for (j = 0; j < sviku.length; j++) {
        summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(sviku[j].split("|")[0]);
        if (summa[summa.length - 1] == "a") {
          _0x93b6x4c[_0x93b6x4d - 1][0] = "1";
          _0x93b6x4c[_0x93b6x4d - 1][1] = "<li>" + sviku[j].split("|")[1] + " என்று முடியும் சொல்லுக்கு முன் மிகும்</li>";
          break;
        }
        ;
      }
      ;
    }
    ;
    if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
      for (j = 0; j < nvaru.length; j++) {
        summa = ("a" + _0x93b6x4b[_0x93b6x4d]).split(nvaru[j]);
        if (summa[0] == "a") {
          _0x93b6x4c[_0x93b6x4d - 1][0] = "";
          _0x93b6x4c[_0x93b6x4d - 1][2] = "<li>\\'" + nvaru[j] + "\\' என்னும் வார்த்தை அடுத்ததாக வருவதால் வலிமிகாது</li>";
          break;
        }
        ;
      }
      ;
    }
    ;
    if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
      for (j = 0; j < nvarusol.length; j++) {
        if (_0x93b6x4b[_0x93b6x4d] == nvarusol[j]) {
          _0x93b6x4c[_0x93b6x4d - 1][0] = "";
          _0x93b6x4c[_0x93b6x4d - 1][2] = "<li>\\'" + nvarusol[j] + "\\' என்னும் வார்த்தை அடுத்ததாக வருவதால் வலிமிகாது</li>";
          break;
        }
        ;
      }
      ;
    }
    ;
  }
  ;
  for (_0x93b6x4d = 1; _0x93b6x4d < _0x93b6x4b.length; _0x93b6x4d++) {
    if (_0x93b6x4d == 1 || _0x93b6x4d == _0x93b6x4b.length - 1 || (_0x93b6x4c[_0x93b6x4d - 2][0] == "0" || _0x93b6x4c[_0x93b6x4d - 1][0] == "0" || _0x93b6x4c[_0x93b6x4d][0] == "0")) {
      if (_0x93b6x4c[_0x93b6x4d - 1][4] == "0") {
        for (j = 0; j < ppeyar.length; j++) {
          summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(ppeyar[j]);
          if (summa[summa.length - 1] == "a") {
            _0x93b6x4c[_0x93b6x4d - 1][4] = "4";
            _0x93b6x4c[_0x93b6x4d - 1][6] = "1";
            break;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][4] == "0") {
        for (j = 0; j < peyar.length; j++) {
          summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(peyar[j]);
          if (summa[summa.length - 1] == "a") {
            _0x93b6x4c[_0x93b6x4d - 1][4] = "4";
            break;
          }
          ;
        }
        ;
      }
      ;
      for (j = 0; j < apeyar.length; j++) {
        summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(apeyar[j]);
        if (summa[summa.length - 1] == "a") {
          _0x93b6x4c[_0x93b6x4d - 1][4] = "0";
          break;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][4] == "0") {
        for (j = 0; j < venai.length; j++) {
          summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(venai[j]);
          if (summa[summa.length - 1] == "a") {
            _0x93b6x4c[_0x93b6x4d - 1][4] = "2";
            break;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][4] == "0") {
        for (j = 0; j < vppin.length; j++) {
          if (_0x93b6x4b[_0x93b6x4d - 1].lastIndexOf(vppin[j]) == _0x93b6x4b[_0x93b6x4d - 1].length - vppin[j].length) {
            if (_0x93b6x4c[_0x93b6x4d - 1][4] == "0") {
              for (k = 0; k < ppeyar.length; k++) {
                if (_0x93b6x4b[_0x93b6x4d - 1].lastIndexOf(ppeyar[k] + vppin[j]) == _0x93b6x4b[_0x93b6x4d - 1].length - ppeyar[k].length - vppin[j].length - 1) {
                  _0x93b6x4c[_0x93b6x4d - 1][4] = "4";
                  break;
                }
                ;
              }
              ;
            }
            ;
            if (_0x93b6x4c[_0x93b6x4d - 1][4] == "0") {
              for (k = 0; k < peyar.length; k++) {
                if (_0x93b6x4b[_0x93b6x4d - 1].lastIndexOf(peyar[k] + vppin[j]) == _0x93b6x4b[_0x93b6x4d - 1].length - peyar[k].length - vppin[j].length - 1) {
                  _0x93b6x4c[_0x93b6x4d - 1][4] = "4";
                  break;
                }
                ;
              }
              ;
            }
            ;
            if (_0x93b6x4c[_0x93b6x4d - 1][4] == "0") {
              for (k = 0; k < venai.length; k++) {
                if (_0x93b6x4b[_0x93b6x4d - 1].lastIndexOf(venai[k] + vppin[j]) == _0x93b6x4b[_0x93b6x4d - 1].length - venai[k].length - vppin[j].length - 1) {
                  _0x93b6x4c[_0x93b6x4d - 1][4] = "2";
                  break;
                }
                ;
              }
              ;
            }
            ;
            break;
          }
          ;
        }
        ;
      }
      ;
    }
    ;
  }
  ;
  for (_0x93b6x4d = 1; _0x93b6x4d < _0x93b6x4b.length; _0x93b6x4d++) {
    if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        for (j = 0; j < vecham.length; j++) {
          summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(vecham[j].split("|")[0]);
          if (summa[summa.length - 1] == "a") {
            if (vecham[j].split("|")[1] == "1") {
              _0x93b6x4c[_0x93b6x4d - 1][0] = "1";
              _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>வினையெச்சமாக இருந்தால்*</li>";
              _0x93b6x53(_0x93b6x4d - 1);
              _0x93b6x4c[_0x93b6x4d - 1][4] = "2";
            }
            ;
            if (vecham[j].split("|")[1] == "0") {
              _0x93b6x4c[_0x93b6x4d - 1][0] = "0";
              _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>வினையெச்சமாக இருந்தால்</li>";
            }
            ;
            if (vecham[j].split("|")[1] == "2" && _0x93b6x4c[_0x93b6x4d][4] == "2") {
              _0x93b6x4c[_0x93b6x4d - 1][0] = "1";
              _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>வினையெச்சமாக இருந்தால்*</li>";
              _0x93b6x53(_0x93b6x4d - 1);
              _0x93b6x4c[_0x93b6x4d - 1][4] = "2";
            }
            ;
            break;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        for (j = 0; j < mviku.length; j++) {
          summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(mviku[j]);
          if (summa[summa.length - 1] == "a") {
            _0x93b6x4c[_0x93b6x4d - 1][0] = "1";
            _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>\\'" + _0x93b6x4b[_0x93b6x4d - 1] + "ம்\\' என்ற சொல்லின் மகரம் கெட்டால்*</li>";
            _0x93b6x4c[_0x93b6x4d - 1][4] = "4";
            break;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0" & _0x93b6x4c[_0x93b6x4d][4] != "2") {
        for (j = 0; j < pecham.length; j++) {
          summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(pecham[j].split("|")[0]);
          if (summa[summa.length - 1] == "a") {
            _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li> பெயரெச்சச் சொல்யென்றால்</li>";
            if (pecham[j].split("|")[1] == "") {
              if (_0x93b6x4c[_0x93b6x4d][4] == "1" || _0x93b6x4c[_0x93b6x4d][4] == "4") {
                _0x93b6x4c[_0x93b6x4d - 1][4] = "2";
              }
              ;
              _0x93b6x4c[_0x93b6x4d - 1][0] = "";
              _0x93b6x53(_0x93b6x4d - 1);
            }
            ;
            if (pecham[j].split("|")[1] == "0") {
              _0x93b6x4c[_0x93b6x4d - 1][0] = "0";
            }
            ;
            if (pecham[j].split("|")[1] == "2" && _0x93b6x4c[_0x93b6x4d][4] == "4") {
              _0x93b6x4c[_0x93b6x4d - 1][0] = "";
            }
            ;
            break;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        for (j = 0; j < epecham.length; j++) {
          summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(epecham[j].split("|")[0]);
          if (summa[summa.length - 1] == "a") {
            if (_0x93b6x4c[_0x93b6x4d][4] == "1" || _0x93b6x4c[_0x93b6x4d][4] == "4") {
              _0x93b6x4c[_0x93b6x4d - 1][0] = "";
              _0x93b6x4c[_0x93b6x4d - 1][4] = "2";
            } else {
              _0x93b6x4c[_0x93b6x4d - 1][0] = epecham[j].split("|")[1];
            }
            ;
            _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>எதிர்மறைப் பெயரெச்ச சொல்லென்றால்</li>";
            break;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split("ா");
        if (summa[summa.length - 1] == "a") {
          _0x93b6x4c[_0x93b6x4d - 1][0] = "0";
          _0x93b6x4c[_0x93b6x4d - 1][4] = "2";
          _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>ஈறுகெட்ட எதிர்மறைப் பெயரெச்ச சொல்லென்றால்</li>";
        }
        ;
      }
      ;
    }
    ;
  }
  ;
  for (_0x93b6x4d = 1; _0x93b6x4d < _0x93b6x4b.length; _0x93b6x4d++) {
    if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        for (j = 0; j < valli.length; j++) {
          if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0" && _0x93b6x4b[_0x93b6x4d - 1].length < 5) {
            for (k = 0; k < nedil.length; k++) {
              if (_0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 3] == nedil[k] && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 2] == valli[j] && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 1] == "ு") {
                _0x93b6x4c[_0x93b6x4d - 1][0] = "";
                _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>நெடிற்றொடர்க் குற்றியலுகரச் சொல்லென்றால் மிகாது*</li>";
                _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>\\'" + _0x93b6x4b[_0x93b6x4d] + "\\' பெயர்ச்சொல்லென்றால் மிகலாம்</li>";
                _0x93b6x53(_0x93b6x4d - 1);
                break;
              }
              ;
            }
            ;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        for (j = 0; j < valli.length; j++) {
          if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0" && _0x93b6x4b[_0x93b6x4d - 1].length < 5) {
            if (_0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 3] == "ஃ" && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 2] == valli[j] && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 1] == "ு" && _0x93b6x4c[_0x93b6x4d][4] != "1" && _0x93b6x4c[_0x93b6x4d][4] != "4" && _0x93b6x4c[_0x93b6x4d][4] != "0") {
              _0x93b6x4c[_0x93b6x4d - 1][0] = "";
              _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>ஆய்தத்தொடர்க் குற்றியலுகரச் சொல்லென்றால் மிகாது*</li>";
              _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>\\'" + _0x93b6x4b[_0x93b6x4d] + "\\' பெயர்ச்சொல்லென்றால் மிகலாம்</li>";
              _0x93b6x53(_0x93b6x4d - 1);
              break;
            }
            ;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        for (j = 0; j < valli.length; j++) {
          if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0" && _0x93b6x4b[_0x93b6x4d - 1].length > 3) {
            if (_0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 3] != "்" && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 2] == valli[j] && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 1] == "ு" && _0x93b6x4c[_0x93b6x4d][4] != "1" && _0x93b6x4c[_0x93b6x4d][4] != "4" && _0x93b6x4c[_0x93b6x4d][4] != "0") {
              _0x93b6x4c[_0x93b6x4d - 1][0] = "";
              _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>உயிர்த்தொடர்க் குற்றியலுகரச் சொல்லென்றால் மிகாது*</li>";
              _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>\\'" + _0x93b6x4b[_0x93b6x4d] + "\\' பெயர்ச்சொல்லென்றால் மிகலாம்</li>";
              _0x93b6x53(_0x93b6x4d - 1);
              break;
            }
            ;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        if (_0x93b6x4b[_0x93b6x4d].length < 2) {
          _0x93b6x4c[_0x93b6x4d - 1][0] = "";
          _0x93b6x4c[_0x93b6x4d - 1][2] = "<li>அடுத்த வார்த்தை சிறியதாகயுள்ளது</li>";
        }
        ;
      }
      ;
      var _0x93b6x4f = "no";
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        for (j = 0; j < vurubu2t.length; j++) {
          if (_0x93b6x4c[_0x93b6x4d - 1][6] == "1" || _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 1] != "ை") {
            _0x93b6x4f = "yes";
            if (vurubu2t[j] == _0x93b6x4b[_0x93b6x4d]) {
              _0x93b6x4c[_0x93b6x4d - 1][0] = "";
              _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>இரண்டாம் வேற்றுமைத் தொகை என்றால்(ஐ உருபு மறைந்து)</li>";
              break;
            }
            ;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0" && _0x93b6x4f == "no") {
        for (j = 0; j < vurubu2.length; j++) {
          summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(vurubu2[j].split("|")[0]);
          if (summa[summa.length - 1] == "a" && vurubu2[j].length - 2 < _0x93b6x4b[_0x93b6x4d - 1].length) {
            _0x93b6x4c[_0x93b6x4d - 1][0] = vurubu2[j].split("|")[1];
            _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>இரண்டாம் வேற்றுமை விரியாக இருந்தால்</li>";
            break;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        for (j = 0; j < vurubu3.length; j++) {
          summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(vurubu3[j]);
          if (summa[summa.length - 1] == "a") {
            _0x93b6x4c[_0x93b6x4d - 1][0] = "";
            _0x93b6x4c[_0x93b6x4d - 1][2] = "<li>மூன்றாம் வேற்றுமை விரியாக இருந்தால்*</li>" + _0x93b6x4c[_0x93b6x4d - 1][2];
            _0x93b6x53(_0x93b6x4d - 1);
            break;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        for (j = 0; j < vurubu4.length; j++) {
          summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(vurubu4[j].split("|")[0]);
          if (summa[summa.length - 1] == "a") {
            _0x93b6x4c[_0x93b6x4d - 1][0] = vurubu4[j].split("|")[1];
            _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>நான்காம் வேற்றுமை விரியாக இருந்தால்</li>";
            break;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        for (j = 0; j < vurubu5.length; j++) {
          summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(vurubu5[j]);
          if (summa[summa.length - 1] == "a") {
            _0x93b6x4c[_0x93b6x4d - 1][0] = "";
            _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>ஐந்தாம் வேற்றுமை விரியாக இருந்தால்*</li>";
            break;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        for (j = 0; j < vurubu6.length; j++) {
          summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(vurubu6[j].split("|")[0]);
          if (summa[summa.length - 1] == "a") {
            _0x93b6x4c[_0x93b6x4d - 1][0] = vurubu6[j].split("|")[1];
            _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>ஆறாம் வேற்றுமை விரியாக இருந்தால்</li>";
            break;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        for (j = 0; j < vurubu7.length; j++) {
          summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(vurubu7[j]);
          if (summa[summa.length - 1] == "a") {
            _0x93b6x4c[_0x93b6x4d - 1][0] = "0";
            _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>ஏழாம் வேற்றுமை விரியாக இருந்தால்</li>";
            break;
          }
          ;
        }
        ;
      }
      ;
      var _0x93b6x50 = "no";
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        for (j = 0; j < vkutrlilu.length; j++) {
          summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(vkutrlilu[j]);
          if (summa[summa.length - 1] == "a") {
            if (_0x93b6x4c[_0x93b6x4d][4] != "1" && _0x93b6x4c[_0x93b6x4d][4] != "4" && _0x93b6x4c[_0x93b6x4d][4] != "0") {
              _0x93b6x4c[_0x93b6x4d - 1][0] = "1";
              _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>வன்தொடர்க் குற்றியலுகர வினையெச்சச் சொல்லென்றால்*</li>";
              _0x93b6x4c[_0x93b6x4d - 1][2] = "";
            } else {
              _0x93b6x4c[_0x93b6x4d - 1][0] = "0";
              _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>வன்தொடர்க் குற்றியலுகர வினையெச்சச் சொல்லென்றால்</li>";
              _0x93b6x4c[_0x93b6x4d - 1][2] = "";
            }
            ;
            _0x93b6x50 = "yes";
            break;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x50 == "no") {
        if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
          for (j = 0; j < valli.length; j++) {
            for (k = 0; k < valli.length; k++) {
              if (_0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 4] == valli[j] && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 2] == valli[k] && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 1] == "ு") {
                if (_0x93b6x4c[_0x93b6x4d][4] != "1" && _0x93b6x4c[_0x93b6x4d][4] != "4" && _0x93b6x4c[_0x93b6x4d][4] != "0") {
                  _0x93b6x4c[_0x93b6x4d - 1][0] = "";
                  _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>வல்லினம் தொடர்ந்து வந்த குற்றியலுகர வினைச்சொல்லென்றால்*</li>";
                } else {
                  _0x93b6x4c[_0x93b6x4d - 1][0] = "0";
                  _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>வல்லினம் தொடர்ந்து வந்த குற்றியலுகர வினைச்சொல்லென்றால்</li>";
                }
                ;
                break;
              }
              ;
            }
            ;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x50 == "no") {
        if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
          for (j = 0; j < valli.length; j++) {
            for (k = 0; k < 6; k++) {
              if (_0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 4] == melli[k] && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 3] == "்" && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 2] == valli[j] && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 1] == "ு") {
                if (_0x93b6x4c[_0x93b6x4d][4] != "1" && _0x93b6x4c[_0x93b6x4d][4] != "4" && _0x93b6x4c[_0x93b6x4d][4] != "0") {
                  _0x93b6x4c[_0x93b6x4d - 1][0] = "";
                  _0x93b6x53(_0x93b6x4d - 1);
                } else {
                  _0x93b6x4c[_0x93b6x4d - 1][0] = "0";
                }
                ;
                _0x93b6x4c[_0x93b6x4d - 1][2] = "<li>மென்தொடர்க் குற்றியலுகர வினைச்சொல்லென்றால்</li>" + _0x93b6x4c[_0x93b6x4d - 1][2];
                break;
              }
              ;
              if (_0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 4] == idai[k] && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 3] == "்" && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 2] == valli[j] && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 1] == "ு") {
                if (_0x93b6x4c[_0x93b6x4d][4] != "1" && _0x93b6x4c[_0x93b6x4d][4] != "4" && _0x93b6x4c[_0x93b6x4d][4] != "0") {
                  _0x93b6x4c[_0x93b6x4d - 1][0] = "";
                  _0x93b6x53(_0x93b6x4d - 1);
                } else {
                  _0x93b6x4c[_0x93b6x4d - 1][0] = "0";
                }
                ;
                _0x93b6x4c[_0x93b6x4d - 1][2] = "<li>இடைத்தொடர்க் குற்றியலுகர வினைச்சொல்லென்றால்</li>" + _0x93b6x4c[_0x93b6x4d - 1][2];
                break;
              }
              ;
            }
            ;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        if (_0x93b6x4c[_0x93b6x4d][4] == "2" && _0x93b6x4c[_0x93b6x4d - 1][6] == "1") {
          _0x93b6x4c[_0x93b6x4d - 1][0] = "";
          _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>எழுவாய்த் தொடரென்றால் வலிமிகாது (" + _0x93b6x4b[_0x93b6x4d - 1] + "- எழுவாய், " + _0x93b6x4b[_0x93b6x4d] + "- பயனிலை)</li>";
        }
        ;
      }
      ;
      for (j = 0; j < mutrilu.length; j++) {
        if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0" && _0x93b6x4b[_0x93b6x4d - 1].length < 5) {
          summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(mutrilu[j]);
          if (summa[summa.length - 1] == "a") {
            _0x93b6x4c[_0x93b6x4d - 1][0] = "0";
            _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>முற்றியலுகரமாக இருந்தால்</li>";
            break;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        summa1 = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split("ாறு");
        summa2 = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split("படி");
        if (summa1[summa1.length - 1] == "a" || summa2[summa2.length - 1] == "a") {
          _0x93b6x4c[_0x93b6x4d - 1][0] = "0";
          _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>பெயரெச்சங்களோடு படி, ஆறு சேர்ந்த சொல்யென்றால்</li>";
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        for (j = 0; j < vmuttru.length; j++) {
          summa = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split(vmuttru[j].split("|")[0]);
          if (summa[summa.length - 1] == "a") {
            _0x93b6x4c[_0x93b6x4d - 1][0] = vmuttru[j].split("|")[1];
            _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>வியங்கோள் வினைமுற்று என்றால் வலிமிகாது</li>";
            break;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        summa1 = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split("ா");
        summa2 = (_0x93b6x4b[_0x93b6x4d - 1] + "a").split("ோ");
        if (summa1[summa1.length - 1] == "a" || summa2[summa2.length - 1] == "a") {
          _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>\\'" + _0x93b6x4b[_0x93b6x4d - 1] + "\\' என்பது வினா வார்த்தை என்றால் வலிமிகாது</li>";
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        for (j = 0; j < mey.length; j++) {
          if (_0x93b6x4c[_0x93b6x4d][4] == "1" || _0x93b6x4c[_0x93b6x4d][4] == "4" || _0x93b6x4c[_0x93b6x4d][4] == "0") {
            if (_0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 1] == mey[j]) {
              _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>\\'" + _0x93b6x4b[_0x93b6x4d - 1] + "ம்\\' என்ற சொல்லின் மகரம் கெட்டால்</li>";
              break;
            }
            ;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        if (_0x93b6x4c[_0x93b6x4d][4] == "4" || _0x93b6x4c[_0x93b6x4d][4] == "1") {
          for (j = 0; j < cssol.length; j++) {
            if (_0x93b6x4b[_0x93b6x4d - 1] == cssol[j]) {
              _0x93b6x4c[_0x93b6x4d - 1][0] = "1";
              _0x93b6x53(_0x93b6x4d - 1);
            }
            ;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4b[_0x93b6x4d - 1].length < 3) {
        for (j = 0; j < oruword.length; j++) {
          if (_0x93b6x4b[_0x93b6x4d - 1] == oruword[j]) {
            _0x93b6x4c[_0x93b6x4d - 1][0] = "0";
            _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>ஓர் எழுத்துப் பெயர்ச் சொல்லென்றால்</li>";
          }
          ;
        }
        ;
      }
      ;
      for (j = 0; j < valli.length; j++) {
        if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
          if ((_0x93b6x4c[_0x93b6x4d][4] == "1" || _0x93b6x4c[_0x93b6x4d][4] == "4") && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 4] == valli[j] && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 3] == "்" && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 2] == valli[j] && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 1] == "ு") {
            _0x93b6x4c[_0x93b6x4d - 1][0] = "1";
            _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>வன்தொடர்க்குற்றியலுகரத்தைத் தொடர்ந்துவந்த பெயர்சொல்லென்றால்*</li>";
            _0x93b6x53(_0x93b6x4d - 1);
            break;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        _0x93b6x53(_0x93b6x4d - 1);
      }
      ;
    }
    ;
  }
  ;
  for (_0x93b6x4d = 1; _0x93b6x4d < _0x93b6x4b.length; _0x93b6x4d++) {
    if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0" && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 1] != "ை" && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 4] != "க" && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 3] != "்" && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 2] != "க" && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 1] != "ு") {
        for (j = 0; j < cnvarusol.length; j++) {
          if (_0x93b6x4b[_0x93b6x4d] == cnvarusol[j]) {
            _0x93b6x4c[_0x93b6x4d - 1][0] = "";
            _0x93b6x4c[_0x93b6x4d - 1][2] = "<li>\\'" + cnvarusol[j] + "\\' என்னும் வார்த்தை அடுத்ததாக வருவதால் வலிமிகாது</li>";
            break;
          }
          ;
        }
        ;
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0" && _0x93b6x4b[_0x93b6x4d - 1] == "உள்ள") {
        summa3 = (_0x93b6x4b[_0x93b6x4d - 2] + "a").split("ில்");
        if (summa3[summa3.length - 1] == "a") {
          _0x93b6x4c[_0x93b6x4d - 1][0] = "";
          _0x93b6x4c[_0x93b6x4d - 1][2] = "<li>\\'உள்ள\\' என்னும் வார்த்தைக்கு வலிமிகாது</li>";
        } else {
          _0x93b6x4c[_0x93b6x4d - 1][2] = "<li>பெயரெச்ச வார்த்தை -\\'உள்ள\\' என்றால் வலிமிகாது</li>";
        }
        ;
      }
      ;
    }
    ;
  }
  ;
  for (_0x93b6x4d = 1; _0x93b6x4d < _0x93b6x4b.length; _0x93b6x4d++) {
    for (j = 0; j < doudt.length; j++) {
      if (_0x93b6x4b[_0x93b6x4d - 1] == doudt[j]) {
        _0x93b6x4c[_0x93b6x4d - 1][0] = "0";
        _0x93b6x53(_0x93b6x4d - 1);
        break;
      }
      ;
    }
    ;
  }
  ;
  for (_0x93b6x4d = 1; _0x93b6x4d < _0x93b6x4b.length; _0x93b6x4d++) {
    for (j = 0; j < mey.length; j++) {
      for (k = 0; k < uyirmey.length; k++) {
        if (_0x93b6x4b[_0x93b6x4d - 1] == uyirmey[k].split("|")[0] && _0x93b6x4b[_0x93b6x4d][0] == mey[j]) {
          _0x93b6x4c[_0x93b6x4d - 1][0] = "2";
          _0x93b6x4c[_0x93b6x4d - 1][1] = "";
          _0x93b6x4c[_0x93b6x4d - 1][2] = "";
          _0x93b6x4c[_0x93b6x4d - 1][3] = "<li>மெய்யெழுத்து வார்த்தைக்கு முன் \\'" + uyirmey[k].split("|")[1] + "\\' என்ற வார்த்தைதான் வரும்</li>";
        }
        ;
      }
      ;
    }
    ;
    for (j = 0; j < uyir.length; j++) {
      for (k = 0; k < uyirmey.length; k++) {
        if (_0x93b6x4b[_0x93b6x4d - 1] == uyirmey[k].split("|")[1] && _0x93b6x4b[_0x93b6x4d][0] == uyir[j]) {
          _0x93b6x4c[_0x93b6x4d - 1][0] = "2";
          _0x93b6x4c[_0x93b6x4d - 1][1] = "";
          _0x93b6x4c[_0x93b6x4d - 1][2] = "";
          _0x93b6x4c[_0x93b6x4d - 1][3] = "<li>உயிர்ரெழுத்து வார்த்தைக்கு முன் \\'" + uyirmey[k].split("|")[0] + "\\' என்ற வார்த்தை வருவது மரபு</li>";
        }
        ;
      }
      ;
    }
    ;
    if (_0x93b6x4b[_0x93b6x4d] == "அல்லது" && _0x93b6x4b[_0x93b6x4d - 1][_0x93b6x4b[_0x93b6x4d - 1].length - 1] == "ோ" && _0x93b6x4b[_0x93b6x4d + 1][_0x93b6x4b[_0x93b6x4d + 1].length - 1] == "ோ") {
      _0x93b6x4c[_0x93b6x4d - 1][0] = "2";
      _0x93b6x4c[_0x93b6x4d - 1][1] = "";
      _0x93b6x4c[_0x93b6x4d - 1][2] = "";
      _0x93b6x4c[_0x93b6x4d - 1][3] = "<li>" + _0x93b6x4b[_0x93b6x4d - 1] + " " + _0x93b6x4b[_0x93b6x4d + 1] + " என்பதே சரி. ஓ விகுதி வரும் போது அல்லது தேவையில்லை</li>";
    }
    ;
    for (j = 0; j < _0x93b6x4b[_0x93b6x4d - 1].length - 4; j++) {
      if (_0x93b6x4b[_0x93b6x4d - 1][j] == "ற" && _0x93b6x4b[_0x93b6x4d - 1][j + 1] == "்" && _0x93b6x4b[_0x93b6x4d - 1][j + 3] == "்") {
        _0x93b6x4c[_0x93b6x4d - 1][0] = "2";
        _0x93b6x4c[_0x93b6x4d - 1][1] = "";
        _0x93b6x4c[_0x93b6x4d - 1][2] = "";
        _0x93b6x4c[_0x93b6x4d - 1][3] = "<li>றகர மெய்க்கு அருகில் எந்த மெய்யெழுத்தும் வராது</li>";
      }
      ;
      if (_0x93b6x4b[_0x93b6x4d - 1][j] == "ட" && _0x93b6x4b[_0x93b6x4d - 1][j + 1] == "்" && _0x93b6x4b[_0x93b6x4d - 1][j + 3] == "்") {
        _0x93b6x4c[_0x93b6x4d - 1][0] = "2";
        _0x93b6x4c[_0x93b6x4d - 1][1] = "";
        _0x93b6x4c[_0x93b6x4d - 1][2] = "";
        _0x93b6x4c[_0x93b6x4d - 1][3] = "<li>டகர மெய்க்கு அருகில் எந்த மெய்யெழுத்தும் வராது</li>";
      }
      ;
    }
    ;
    if (_0x93b6x4b[_0x93b6x4d] == "கள்" && _0x93b6x4c[_0x93b6x4d - 1][0] != "") {
      _0x93b6x4c[_0x93b6x4d - 1][0] = "0";
      _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>பன்மை  விகுதி என்றால் வலி மிகாது</li>";
      _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>குடிபானம்  எனறால் வலி மிகலாம்</li>";
    }
    ;
    if (_0x93b6x4b[_0x93b6x4d] == "சில" && _0x93b6x4b[_0x93b6x4d - 1] == "சில") {
      _0x93b6x4c[_0x93b6x4d - 1][0] = "2";
      _0x93b6x4c[_0x93b6x4d - 1][2] = "";
      _0x93b6x4c[_0x93b6x4d - 1][1] = "<li>சிலச்சில  அல்லது சிற்சில என அடுக்குத்தொடராக வரும்</li>";
    }
    ;
    if (_0x93b6x4b[_0x93b6x4d] == "பல" && _0x93b6x4b[_0x93b6x4d - 1] == "பல") {
      _0x93b6x4c[_0x93b6x4d - 1][0] = "2";
      _0x93b6x4c[_0x93b6x4d - 1][2] = "";
      _0x93b6x4c[_0x93b6x4d - 1][1] = "<li>பலப்பல  அல்லது பற்பல என அடுக்குத்தொடராக வரும்</li>";
    }
    ;
  }
  ;
  for (_0x93b6x4d = 1; _0x93b6x4d < _0x93b6x4b.length; _0x93b6x4d++) {
    if (_0x93b6x4c[_0x93b6x4d - 1][5] == "1") {
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "") {
        _0x93b6x4c[_0x93b6x4d - 1][0] = "-1";
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "1") {
        _0x93b6x4c[_0x93b6x4d - 1][0] = "";
      }
      ;
      if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0") {
        _0x93b6x4c[_0x93b6x4d - 1][0] = "";
      }
      ;
    }
    ;
  }
  ;
  _0x93b6x4c[_0x93b6x4b.length - 2][2] = "<li>கடைசி வார்த்தைக்கு வலிமிகாது</li>";
  for (_0x93b6x4d = 1; _0x93b6x4d < _0x93b6x4b.length; _0x93b6x4d++) {
    if (_0x93b6x4c[_0x93b6x4d - 1][0] == "0" || _0x93b6x4c[_0x93b6x4d - 1][0] == "1") {
      _0x93b6x4c[_0x93b6x4d - 1][2] = "<li>\\'" + _0x93b6x4b[_0x93b6x4d] + "\\' என்ற சொல் பிறமொழி/வடமொழி/இடப் பெயராகவோ அல்லது \\'" + _0x93b6x4b[_0x93b6x4d - 1] + "\\' என்ற சொல் உயர்திணைப் பெயராகவோ இருந்தால் வலிமிகாது</li>" + _0x93b6x4c[_0x93b6x4d - 1][2];
    }
    ;
  }
  ;
  for (var _0x93b6x4d = 0; _0x93b6x4d < _0x93b6x4a.length; _0x93b6x4d++) {
    _0x93b6x4c[_0x93b6x4d][1] = _0x93b6x4c[_0x93b6x4d][1].replace(/\"/gi, "&#34;");
    _0x93b6x4c[_0x93b6x4d][2] = _0x93b6x4c[_0x93b6x4d][2].replace(/\"/gi, "&#34;");
    if (_0x93b6x4c[_0x93b6x4d][0] == "") {
      temp = temp + " " + "<span id='" + "ezhai" + _0x93b6x4d + "' style='cursor:hand;cursor:pointer'; onclick=\"reason('" + _0x93b6x4c[_0x93b6x4d][1] + "','" + _0x93b6x4c[_0x93b6x4d][2] + "','" + _0x93b6x4c[_0x93b6x4d][3] + "','" + _0x93b6x4d + "','" + (_0x93b6x4d + 1) + "','" + _0x93b6x4c[_0x93b6x4d][0] + "')\">" + _0x93b6x4a[_0x93b6x4d] + "</span>";
    }
    ;
    if (_0x93b6x4c[_0x93b6x4d][0] == "0") {
      temp = temp + " " + "<span id='" + "ezhai" + _0x93b6x4d + "' style='cursor:hand;cursor:pointer'; onclick=\"reason('" + _0x93b6x4c[_0x93b6x4d][1] + "','" + _0x93b6x4c[_0x93b6x4d][2] + "','" + _0x93b6x4c[_0x93b6x4d][3] + "','" + _0x93b6x4d + "','" + (_0x93b6x4d + 1) + "','" + _0x93b6x4c[_0x93b6x4d][0] + "')\"><b>" + _0x93b6x4a[_0x93b6x4d] + "</b></span>";
    }
    ;
    if (_0x93b6x4c[_0x93b6x4d][0] == "1") {
      temp = temp + " <span id='" + "ezhai" + _0x93b6x4d + "' style='cursor:hand;cursor:pointer'; onclick=\"reason('" + _0x93b6x4c[_0x93b6x4d][1] + "','" + _0x93b6x4c[_0x93b6x4d][2] + "','" + _0x93b6x4c[_0x93b6x4d][3] + "','" + _0x93b6x4d + "','" + (_0x93b6x4d + 1) + "','" + _0x93b6x4c[_0x93b6x4d][0] + "')\"><font color='green'>" + _0x93b6x4a[_0x93b6x4d] + _0x93b6x4b[_0x93b6x4d + 1][0] + String.fromCharCode(3021) + "</font></span>";
    }
    ;
    if (_0x93b6x4c[_0x93b6x4d][0] == "2") {
      temp = temp + " <span id='" + "ezhai" + _0x93b6x4d + "' style='cursor:hand;cursor:pointer'; onclick=\"reason('" + _0x93b6x4c[_0x93b6x4d][1] + "','" + _0x93b6x4c[_0x93b6x4d][2] + "','" + _0x93b6x4c[_0x93b6x4d][3] + "','" + _0x93b6x4d + "','" + (_0x93b6x4d + 1) + "','" + _0x93b6x4c[_0x93b6x4d][0] + "')\"><font color='blue'>" + _0x93b6x4a[_0x93b6x4d] + "</font></span>";
    }
    ;
    if (_0x93b6x4c[_0x93b6x4d][0] == "-1") {
      temp = temp + " <span id='" + "ezhai" + _0x93b6x4d + "' style='cursor:hand;cursor:pointer'; onclick=\"reason('" + _0x93b6x4c[_0x93b6x4d][1] + "','" + _0x93b6x4c[_0x93b6x4d][2] + "','" + _0x93b6x4c[_0x93b6x4d][3] + "','" + _0x93b6x4d + "','" + (_0x93b6x4d + 1) + "','" + _0x93b6x4c[_0x93b6x4d][0] + "')\"><font color='red'>" + _0x93b6x4a[_0x93b6x4d].slice(0, _0x93b6x4a[_0x93b6x4d].length - 2) + "</font></span>";
    }
    ;
    sol[_0x93b6x4d] = _0x93b6x4a[_0x93b6x4d];
    elu[_0x93b6x4d] = _0x93b6x4b[_0x93b6x4d][0];
  }
  ;
  var _0x93b6x51 = "<br/><br/><table>";
  var _0x93b6x52 = "";
  for (var _0x93b6x4d = 0; _0x93b6x4d < _0x93b6x4a.length; _0x93b6x4d++) {
    _0x93b6x51 = _0x93b6x51 + "<tr><td>" + _0x93b6x4a[_0x93b6x4d] + "</td><td>" + _0x93b6x4c[_0x93b6x4d][0] + "</td><td>" + _0x93b6x4c[_0x93b6x4d][1] + "</td><td>" + _0x93b6x4c[_0x93b6x4d][4] + "</td></tr>";
    if (_0x93b6x4c[_0x93b6x4d][0] == "0") {
      _0x93b6x52 = _0x93b6x52 + "<span id='" + "ezhai" + _0x93b6x4d + "' style='cursor:hand;cursor:pointer'; onclick=\"reason('" + _0x93b6x4c[_0x93b6x4d][1] + "','" + _0x93b6x4c[_0x93b6x4d][2] + "','" + _0x93b6x4c[_0x93b6x4d][3] + "','" + _0x93b6x4d + "','" + (_0x93b6x4d + 1) + "','" + _0x93b6x4c[_0x93b6x4d][0] + "')\"><b>" + _0x93b6x4a[_0x93b6x4d] + " " + _0x93b6x4a[_0x93b6x4d + 1] + "</b></span><br/>";
    }
    ;
  }
  ;
  _0x93b6x51 = _0x93b6x51 + "</table>";
  tharam = 0;
  kulapam = 0;
  opizhai = 0;
  vpizhai = 0;
  for (_0x93b6x4d = 0; _0x93b6x4d < _0x93b6x4c.length; _0x93b6x4d++) {
    if (_0x93b6x4c[_0x93b6x4d][0] == "1") {
      tharam = tharam + 1;
    }
    ;
    if (_0x93b6x4c[_0x93b6x4d][0] == "0") {
      kulapam = kulapam + 1;
    }
    ;
    if (_0x93b6x4c[_0x93b6x4d][0] == "-1") {
      opizhai = opizhai + 1;
    }
    ;
    if (_0x93b6x4c[_0x93b6x4d][0] == "2") {
      vpizhai = vpizhai + 1;
    }
    ;
  }
  ;
  document.getElementById("Reasonyes").innerHTML = "";
  document.getElementById("Reasonno").innerHTML = "";
  document.getElementById("userChoice").innerHTML = "";
  document.getElementById("hAnchor").innerHTML = "<span class='badge rounded-pill bg-success'>பரிந்துரை : " + tharam + "</span> <span class='badge rounded-pill bg-warning text-dark'>சந்தேகிப்பவை : " + kulapam + "</span> <span class='badge rounded-pill bg-info text-dark'>ஒற்றுப்பிழை : " + opizhai + "</span> <span class='badge rounded-pill bg-danger'>மரபுப்பிழை : " + vpizhai + "</span> <span style='font-size: x-small;'>(சொற்களில் சொடிக்கி காரணம் காண்க!)</span>";
  document.getElementById("myAnchor").innerHTML = "<div id='rAnchor'>" + temp + "</div><center><input class='btn btn-primary btn-sm mt-3 mb-3' type='button' onclick='takeme()' value='திருத்தவும்'/></center>";
  function _0x93b6x53(_0x93b6x54) {
    _0x93b6x4d = _0x93b6x54 + 1;
    if (_0x93b6x4c[_0x93b6x4d - 1][4] == "2") {
      return;
    }
    ;
    if (_0x93b6x4c[_0x93b6x4d][4] == "1" || _0x93b6x4c[_0x93b6x4d][4] == "4" || _0x93b6x4c[_0x93b6x4d][4] == "0") {
      _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>4 ஆம் வேற்றுமைத் தொகை (" + _0x93b6x4b[_0x93b6x4d - 1] + "+ ஆக/கு " + _0x93b6x4b[_0x93b6x4d] + ")</li>";
      _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>6 ஆம் வேற்றுமைத் தொகை (" + _0x93b6x4b[_0x93b6x4d - 1] + "+ உடைய/பற்றிய/அது " + _0x93b6x4b[_0x93b6x4d] + ")</li>";
      _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>உவமைத்தொகை (" + _0x93b6x4b[_0x93b6x4d - 1] + " போன்ற " + _0x93b6x4b[_0x93b6x4d] + ")</li>";
      _0x93b6x4c[_0x93b6x4d - 1][1] = _0x93b6x4c[_0x93b6x4d - 1][1] + "<li>பண்புத் தொகை, ஊர்ப்பெயர் என்றால் வலிமிகும்.</li>";
    }
    ;
    if (_0x93b6x4c[_0x93b6x4d][4] == "2" || _0x93b6x4c[_0x93b6x4d][4] == "0") {
      _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>7 ஆம் வேற்றுமைத் தொகை(" + _0x93b6x4b[_0x93b6x4d - 1] + "+ இல்/கண் " + _0x93b6x4b[_0x93b6x4d] + ")</li>";
      _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>5 ஆம் வேற்றுமைத் தொகை (" + _0x93b6x4b[_0x93b6x4d - 1] + "+ இன்/இருந்து " + _0x93b6x4b[_0x93b6x4d] + ")</li>";
      _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>3 ஆம் வேற்றுமைத் தொகை (" + _0x93b6x4b[_0x93b6x4d - 1] + "+ ஆல்/ஓடு " + _0x93b6x4b[_0x93b6x4d] + ")</li>";
      _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>2 ஆம் வேற்றுமைத் தொகை (" + _0x93b6x4b[_0x93b6x4d - 1] + "+ ஐ " + _0x93b6x4b[_0x93b6x4d] + ")</li>";
    }
    ;
    _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>உம்மைத்தொகை (" + _0x93b6x4b[_0x93b6x4d - 1] + "+ உம், " + _0x93b6x4b[_0x93b6x4d] + "+உம்)</li>";
    _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>எழுவாய்த் தொடர் (" + _0x93b6x4b[_0x93b6x4d - 1] + "- எழுவாய், " + _0x93b6x4b[_0x93b6x4d] + "- பயனிலை)</li>";
    _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>விளித் தொடர் (" + _0x93b6x4b[_0x93b6x4d] + "-ஏவல் வினையென்றால்)</li>";
    _0x93b6x4c[_0x93b6x4d - 1][2] = _0x93b6x4c[_0x93b6x4d - 1][2] + "<li>வினைத்தொகை, அடுக்குத் தொடர், இரட்டைக்கிளவி என்றால் வலிமிகாது</li>";
  }
  ;
  toggleView(); // Show correction area
}
;
function uChoice(_0x93b6x56, _0x93b6x57) {
  document.getElementById("ezhai" + _0x93b6x56).innerHTML = document.getElementById(_0x93b6x57).innerHTML;
}
;
function reason(_0x93b6x59, _0x93b6x5a, _0x93b6x5b, _0x93b6x5c, _0x93b6x5d, _0x93b6x5e) {
  document.getElementById("userChoice").innerHTML = "";
  if (_0x93b6x5e == "0" || _0x93b6x5e == "1") {
    document.getElementById("userChoice").innerHTML = "<h6>உங்கள் விருப்பம்: </h6><a class='btn btn-primary btn-sm mr-2' style='cursor:hand;cursor:pointer'; onclick='uChoice(" + _0x93b6x5c + ",\"muthal\")'><span id='muthal'>" + sol[_0x93b6x5c] + "</span>?</a> &nbsp;<a class='btn btn-primary btn-sm' style='cursor:hand;cursor:pointer'; onclick='uChoice(" + _0x93b6x5c + ",\"irandu\")'><span id='irandu'>" + sol[_0x93b6x5c] + elu[_0x93b6x5d] + String.fromCharCode(3021) + "</span>?</a>";
  }
  ;
  if (_0x93b6x5e == "-1") {
    document.getElementById("userChoice").innerHTML = "<h6>உங்கள் விருப்பம்: </h6> <a class='btn btn-primary btn-sm mr-2' style='cursor:hand;cursor:pointer'; onclick='uChoice(" + _0x93b6x5c + ",\"muthal\")'><span id='muthal'>" + sol[_0x93b6x5c] + "</span>?</a> &nbsp;<a class='btn btn-primary btn-sm mr-2' style='cursor:hand;cursor:pointer'; onclick='uChoice(" + _0x93b6x5c + ",\"irandu\")'><span id='irandu'>" + sol[_0x93b6x5c].slice(0, sol[_0x93b6x5c].length - 2) + "</span>?</a>";
  }
  ;
  if (_0x93b6x59.length > 1) {
    document.getElementById("Reasonyes").innerHTML = "<br><p style='margin-bottom:3px;'><b>வலி மிகுவதற்கான காரணிகள்</b></p><ul class='mb-2' style='-moz-border-radius: 1em; background-color: #FFCCFF; border: 2px solid #FF99FF; padding-top: 8px; padding-bottom: 8px; padding-right: 4px;padding-left: 19px;'>" + _0x93b6x59 + "</ul>";
  } else {
    document.getElementById("Reasonyes").innerHTML = "";
  }
  ;
  if (_0x93b6x5a.length > 1) {
    document.getElementById("Reasonno").innerHTML = "<b><p style='margin-bottom:3px;'>வலி மிகாததற்கான காரணிகள்</b></p><ul style='-moz-border-radius: 1em; background-color: #FFCCFF; border: 2px solid #FF99FF; padding-top: 8px; padding-bottom: 8px; padding-right: 4px;padding-left: 19px;'>" + _0x93b6x5a + "</ul>";
  } else {
    document.getElementById("Reasonno").innerHTML = "";
  }
  ;
  if (_0x93b6x5b.length > 1) {
    document.getElementById("pReason").innerHTML = "<b> வாக்கியப்பிழை </b><ul style='-moz-border-radius: 1em; background-color: #CCFFFF; border: 2px solid #99CEDF; padding-top: 8px; padding-bottom: 8px; padding-right: 4px;padding-left: 19px; font-size: small;'>" + _0x93b6x5b + "</ul>";
  } else {
    document.getElementById("pReason").innerHTML = "";
  }
  ;
  // Show sidebar on mobile
      const sidebar = document.getElementById('sidebar');
      if (window.innerWidth < 992) {
        sidebar.classList.add('show');
      }
}
;
function takeme() {
  document.vizuthukal.tbox.value = document.getElementById("rAnchor").innerText;

  // Show the text area and hide the correction area
  document.getElementById("text-input-area").style.display = 'block';
  document.getElementById("correction-area").style.display = 'none';
  document.getElementById("toggleIcon").style.display = 'none';

  document.getElementById("myAnchor").innerHTML = "";
  document.getElementById("hAnchor").innerHTML = "";
  document.getElementById("Reasonyes").innerHTML = "";
  document.getElementById("Reasonno").innerHTML = "";
  document.getElementById("userChoice").innerHTML = "";

}
;
